Examinator/src/DataProcessors/УправлениеДоступомСУО/УправлениеДоступомСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеДоступомСУО</name>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходВПрограммуРазрешен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияСтандартная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияOpenID</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияОС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьВСпискеВыбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходВВебКабинетРазрешен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПарольУстановлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрещеноИзменятьПароль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Недействителен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыДоступаСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыПользователейСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоступаИстекло</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДоступа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДоступа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/ПользователиВебКабинетаСУ/ПользователиВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиВебКабинетаСУ</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ВремяДоступаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяДоступаПользователейСУО</name>
  <attributes>
    <name>ДатаНачалаДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/РассылкаСообщенийСУО/РассылкаСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РассылкаСообщенийСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <basedOn>Catalog.УчебныеГруппыСУО</basedOn>
  <basedOn>Document.ПроведениеОбученияСУО</basedOn>
  <basedOn>Document.ПроведениеПрограммыОбученияСУО</basedOn>
  <basedOn>Catalog.СерииПинКодовСУО</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.СерииПинКодовСУО</types>
      <types>DocumentRef.ВосстановлениеПароляСУ</types>
      <types>CatalogRef.ОтборыПользователейСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеАвтоматическойРассылки</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.НовостьСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтоматическойРассылки</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторуАвтоматическойРассылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподавателям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организаторам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезШаблона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьФайлыОснования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>DocumentRef.СообщениеСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправленоНаЭлектроннуюПочту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправкаНаЭлектроннуюПочтуЗапрещена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПопытокОтправкиНаЭлектроннуюПочту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникТерриторииСУО</name>
      <description>Контактная информация справочника &quot;Территории&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/DataProcessors/УправлениеДоступомСУО/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ПользователиГруппа6.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияВремениДоступаКПрограммеСУО");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователи

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Пользователи

&НаКлиенте
Процедура ПользователиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Пользователь) Тогда
		ДанныеДоступаПользователя = ДанныеДоступаПользователя(Элемент.ТекущиеДанные.Пользователь);
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, ДанныеДоступаПользователя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Пользователь);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;
	
	Объект.Пользователи.Очистить();
	 
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл
		ДанныеДоступаПользователя = ДанныеДоступаПользователя(ВыбранныйПользователь);
		НоваяСтрока = Объект.Пользователи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДоступаПользователя);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОставитьВсехСЭтимЗначениемСвойства(Команда)
	ФильтроватьСписок(Элементы.Пользователи.ТекущийЭлемент, Ложь) 
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсехСЭтимЗначениемСвойства(Команда)
	ФильтроватьСписок(Элементы.Пользователи.ТекущийЭлемент, Истина) 
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступ(Команда)	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораНастроекДоступа", ЭтотОбъект);	
	ОткрытьФорму("Обработка.УправлениеДоступомСУО.Форма.НастроитьДоступ",Новый Структура("КоличествоПользователей", Объект.Пользователи.Количество()),,,,,ОписаниеОповещенияОЗакрытии);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)

	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Пользователи);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписок(Команда)
	Объект.Пользователи.Очистить();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ДанныеДоступаПользователя(Знач Пользователь)
	
	ДанныеВозврата = Новый Структура("
		|Пользователь,
		|ПолноеИмя,
		|Имя,
		|ВходВПрограммуРазрешен,
		|АутентификацияСтандартная,
		|АутентификацияOpenID,
		|АутентификацияОС,
		|ПоказыватьВСпискеВыбора,
		|ВходВВебКабинетРазрешен,
		|ПарольУстановлен,
		|ЗапрещеноИзменятьПароль,
		|ЭлектроннаяПочта,
		|Недействителен,
		|ГруппыДоступаСтрокой,
		|ГруппыПользователейСтрокой,
		|ВремяДоступаИстекло,
		|ДатаНачалаДоступа,
		|ДатаОкончанияДоступа",
		Пользователь,
		"",
		"",
		Ложь,
		Ложь,
		Ложь,
		Ложь,
		Ложь,
		Ложь,
		Ложь,
		Ложь,
		"",
		Ложь,
		"",
		"",
		Ложь,
		Неопределено,
		Неопределено
	);
	
	СвойстваПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "Наименование, Недействителен, ИдентификаторПользователяИБ");
	
	ДанныеВозврата.Пользователь = Пользователь;	
	ДанныеВозврата.Недействителен = СвойстваПользователя.Недействителен;
	ДанныеВозврата.ПолноеИмя = СвойстваПользователя.Наименование;
	ДанныеВозврата.ЭлектроннаяПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя);

	Если ЗначениеЗаполнено(СвойстваПользователя.ИдентификаторПользователяИБ) Тогда
		
		СвойстваПользователяИБ = Неопределено;
		ОписаниеОшибки = Неопределено;
		Пользователи.ПрочитатьПользователяИБ(СвойстваПользователя.ИдентификаторПользователяИБ, СвойстваПользователяИБ, ОписаниеОшибки);
		
		Если СвойстваПользователяИБ = Неопределено ИЛИ ТипЗнч(СвойстваПользователяИБ) <> Тип("Структура") Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			
		Иначе
			ДанныеВозврата.Имя = СвойстваПользователяИБ.Имя;		
			
			ДанныеВозврата.ВходВПрограммуРазрешен = Пользователи.ВходВПрограммуРазрешен(СвойстваПользователяИБ);
			ДанныеВозврата.АутентификацияСтандартная = СвойстваПользователяИБ.АутентификацияСтандартная;
			ДанныеВозврата.АутентификацияOpenID = СвойстваПользователяИБ.АутентификацияOpenID;
			ДанныеВозврата.АутентификацияОС = СвойстваПользователяИБ.АутентификацияОС;			
			ДанныеВозврата.ПоказыватьВСпискеВыбора = СвойстваПользователяИБ.ПоказыватьВСпискеВыбора;
			ДанныеВозврата.ВходВВебКабинетРазрешен = РегистрыСведений.ПользователиВебКабинетаСУ.ПользовательСуществует(, Пользователь);
			ДанныеВозврата.ПарольУстановлен = СвойстваПользователяИБ.ПарольУстановлен;
			ДанныеВозврата.ЗапрещеноИзменятьПароль = СвойстваПользователяИБ.ЗапрещеноИзменятьПароль;
			
		КонецЕсли;				
				
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыДоступаПользователи.Ссылка,
		|	ГруппыДоступаПользователи.Ссылка.Наименование КАК НаименованиеГруппыДоступа
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &Пользователь
		|	И ГруппыДоступаПользователи.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл			
			ДанныеВозврата.ГруппыДоступаСтрокой = ДанныеВозврата.ГруппыДоступаСтрокой + ВыборкаДетальныеЗаписи.НаименованиеГруппыДоступа + ", ";
		КонецЦикла;
		
		ДанныеВозврата.ГруппыДоступаСтрокой = Лев(ДанныеВозврата.ГруппыДоступаСтрокой, СтрДлина(ДанныеВозврата.ГруппыДоступаСтрокой) - 2);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыПользователейСостав.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Пользователь = &Пользователь
		|	И ГруппыПользователейСостав.Ссылка <> &ГруппаВсеПользователи";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ГруппаВсеПользователи", Справочники.ГруппыПользователей.ВсеПользователи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДанныеВозврата.ГруппыПользователейСтрокой = ДанныеВозврата.ГруппыПользователейСтрокой + ВыборкаДетальныеЗаписи.Наименование + ", ";
		КонецЦикла;
		
		ДанныеВозврата.ГруппыПользователейСтрокой = Лев(ДанныеВозврата.ГруппыПользователейСтрокой, СтрДлина(ДанныеВозврата.ГруппыПользователейСтрокой) - 2);
		
	КонецЕсли;
	
	ДатыДоступа = РегистрыСведений.ВремяДоступаПользователейСУО.ДатыДоступа(Пользователь);
	
	Если ДатыДоступа <> Неопределено Тогда
		
		ДанныеВозврата.ДатаНачалаДоступа = ?(ЗначениеЗаполнено(ДатыДоступа.ДатаНачалаДоступа), НачалоДня(ДатыДоступа.ДатаНачалаДоступа), Неопределено);
		ДанныеВозврата.ДатаОкончанияДоступа = ?(ЗначениеЗаполнено(ДатыДоступа.ДатаОкончанияДоступа), КонецДня(ДатыДоступа.ДатаОкончанияДоступа), Неопределено);
		ДанныеВозврата.ВремяДоступаИстекло = НЕ РегистрыСведений.ВремяДоступаПользователейСУО.ДоступРазрешен(ДатыДоступа.ДатаНачалаДоступа, ДатыДоступа.ДатаОкончанияДоступа, ТекущаяДатаСеанса());
		
	КонецЕсли;

	
	Возврат ДанныеВозврата;
	
КонецФункции

&НаКлиенте
Процедура ФильтроватьСписок(ТекущийЭлемент, УдалятьВыбранное) 
	
	Если ТекущийЭлемент = Неопределено
		ИЛИ Элементы.Пользователи.ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяСвойства = Сред(ТекущийЭлемент.Имя, СтрДлина("Пользователи") + 1);
	ЗначениеСвойства = Элементы.Пользователи.ТекущиеДанные[ИмяСвойства];
	
	СтрокиСоЗначением = Объект.Пользователи.НайтиСтроки(Новый Структура(ИмяСвойства, ЗначениеСвойства));
	
	СтрокиДляУдаления = Новый Массив;
	Если УдалятьВыбранное Тогда
		СтрокиДляУдаления = СтрокиСоЗначением;
	Иначе
		Для каждого СтрокаТЗ Из Объект.Пользователи Цикл
			Если СтрокиСоЗначением.Найти(СтрокаТЗ) = Неопределено Тогда
				СтрокиДляУдаления.Добавить(СтрокаТЗ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаТЗ Из СтрокиДляУдаления Цикл
		Объект.Пользователи.Удалить(СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастроекДоступа(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Выполняется настройка доступа'"),,НСтр("ru = 'Пожалуйста, подождите...'"));

	Если УстановитьНастройкиДоступа(РезультатЗакрытия) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Настройки успешно установлены'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьНастройкиДоступа(Знач НастройкиДоступа)
	
	УстановитьПривилегированныйРежим(Истина); 
	
	// Делаем проверки
	
	Если ТипЗнч(НастройкиДоступа) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НастройкиДоступа.Настройки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НастройкиДоступа.Рассылка <> Неопределено Тогда
		
		ПользователиБезЭлектроннойПочты = Новый Массив;
		
		Для каждого СтрокаТЧ Из Объект.Пользователи Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ЭлектроннаяПочта) Тогда
				ПользователиБезЭлектроннойПочты.Добавить(СтрокаТЧ.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
		
		Если ПользователиБезЭлектроннойПочты.Количество() > 0 Тогда
			СписокЛицБезАдресаПочты = "";
			Для каждого ИмяПользователя Из ПользователиБезЭлектроннойПочты Цикл
				СписокЛицБезАдресаПочты = СписокЛицБезАдресаПочты + ИмяПользователя + ", ";
			КонецЦикла;
			СписокЛицБезАдресаПочты = Лев(СписокЛицБезАдресаПочты, СтрДлина(СписокЛицБезАдресаПочты) - 2);
			ТекстСообщения = НСтр("ru = 'Настройка доступа не выполнена, поскольку некоторым пользователям невозможно выслать сообщение. У следующих пользователей не указан адрес эл. почты: %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СписокЛицБезАдресаПочты);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
			
	КонецЕсли;				
	
	// Указываем настройки
	
	СсылкаНеуказанногоПользователя = Пользователи.СсылкаНеуказанногоПользователя();
	
	НачатьТранзакцию();
	
	Попытка
				
		Для каждого СтрокаТЧ Из Объект.Пользователи Цикл
			
			// Проверки
			//
			
			Если СтрокаТЧ.Пользователь = СсылкаНеуказанногоПользователя Тогда
				Продолжить;
			КонецЕсли;
			
			// Свойства пользователя ИБ
			//			
			
			ОписаниеПользователяИБ = Неопределено;
			
			Для каждого ЭлементНастройки Из НастройкиДоступа.Настройки Цикл
			
				Если ЭлементНастройки.Имя = "Пароль"
					ИЛИ ЭлементНастройки.Имя = "ПоказыватьВСпискеВыбора"
					ИЛИ ЭлементНастройки.Имя = "ЗапрещеноИзменятьПароль"
					ИЛИ ЭлементНастройки.Имя = "АутентификацияСтандартная"
					ИЛИ ЭлементНастройки.Имя = "АутентификацияOpenID"
					ИЛИ ЭлементНастройки.Имя = "Недействителен" 
					ИЛИ ЭлементНастройки.Имя = "ВходВПрограммуРазрешен"
					ИЛИ ЭлементНастройки.Имя = "Логин" Тогда
					
					Если ОписаниеПользователяИБ = Неопределено Тогда
						ОписаниеПользователяИБ = Новый Структура;
						ОписаниеПользователяИБ.Вставить("Действие", "Записать");
					КонецЕсли;
					
					Если ЭлементНастройки.Имя = "Пароль" Тогда
						
						Если ЭлементНастройки.Значение = "УстановитьСлучайный" Тогда
							ОписаниеПользователяИБ.Вставить("Пароль", ОбщегоНазначенияСУКлиентсервер.ЧислоВСтроку(ОбщегоНазначенияСУ.СлучайноеЧисло(100000, 999999999)));
						Иначе
							ОписаниеПользователяИБ.Вставить("Пароль", "");
						КонецЕсли;
						
					ИначеЕсли ЭлементНастройки.Имя = "Логин" Тогда
						
						Если ЭлементНастройки.Значение = "СформироватьИзПолногоИмени" Тогда
							ОписаниеПользователяИБ.Вставить("Имя", 
								ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(СтрокаТЧ.ПолноеИмя));
						ИначеЕсли ЭлементНастройки.Значение = "УстановитьЭлектроннуюПочту" Тогда
							Если ЗначениеЗаполнено(СтрокаТЧ.ЭлектроннаяПочта) Тогда
								ОписаниеПользователяИБ.Вставить("Имя", СтрокаТЧ.ЭлектроннаяПочта);
							Иначе
								ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Адрес электронной почты пользователя %1 не задан'"), СтрокаТЧ.ПолноеИмя);
							КонецЕсли;
						Иначе
							ВызватьИсключение НСтр("ru = 'Неизвестное значение настройки логина'");
						КонецЕсли;
						
					Иначе
						
						ОписаниеПользователяИБ.Вставить(ЭлементНастройки.Имя, ЭлементНастройки.Значение);
						
					КонецЕсли;
					
				КонецЕсли;				
				
			КонецЦикла;			
			
			Если ОписаниеПользователяИБ <> Неопределено Тогда
				
				Если ОписаниеПользователяИБ.Свойство("ВходВПрограммуРазрешен")
					И ОписаниеПользователяИБ.ВходВПрограммуРазрешен Тогда
					
					ОписаниеПользователяИБ.Вставить("Недействителен", Ложь);
					
					ЕстьТипАутентификации = Ложь;
					
					Если ОписаниеПользователяИБ.Свойство("АутентификацияСтандартная")
						И ОписаниеПользователяИБ.АутентификацияСтандартная Тогда
						
						ЕстьТипАутентификации = Истина;
						
					КонецЕсли;
					
					Если ОписаниеПользователяИБ.Свойство("АутентификацияOpenID")
						И ОписаниеПользователяИБ.АутентификацияOpenID Тогда
						
						ЕстьТипАутентификации = Истина;
						
					КонецЕсли;
					
					Если НЕ ЕстьТипАутентификации Тогда
						ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Истина);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ОписаниеПользователяИБ.Свойство("Недействителен")
					И ОписаниеПользователяИБ.Недействителен Тогда

					ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Ложь);
					
				КонецЕсли;
				
				ПользовательОбъект = СтрокаТЧ.Пользователь.ПолучитьОбъект();
				
				Если ОписаниеПользователяИБ.Свойство("Недействителен") Тогда					
					ПользовательОбъект.Недействителен = ОписаниеПользователяИБ.Недействителен;
				КонецЕсли;
				
				Если ПользовательОбъект.СвойстваПользователяИБ.Получить() = Неопределено
					И НЕ ОписаниеПользователяИБ.Свойство("Имя") Тогда
					
					// Нет свойств пользователя ИБ, поэтому добавляем обязательные свойства,
					// без которых пользователь не создасться.
	
					Логин                = ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(ПользовательОбъект.Наименование);
					СчетчикПользователей = 0;
					Постфикс             = "";
					
					Пока Истина Цикл
				
						ПользовательИБСуществующий = ПользователиИнформационнойБазы.НайтиПоИмени(Логин + Постфикс);
						
						Если ПользовательИБСуществующий = Неопределено Тогда
							Прервать;
						Иначе
							СчетчикПользователей = СчетчикПользователей + 1;
							Постфикс = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(СчетчикПользователей);				
						КонецЕсли;
						
						Если СчетчикПользователей > 100 Тогда
							ВызватьИсключение НСтр("ru = 'Невозможно создать уникальное имя пользователя'")
						КонецЕсли;
						
					КонецЦикла;
					
					Логин =  Логин + Постфикс;
					ОписаниеПользователяИБ.Вставить("Имя", Логин);
					
				КонецЕсли;
				
				ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
				
				ПользовательОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета",
					РегистрыСведений.ПользователиВебКабинетаСУ.ПользовательСуществует(, ПользовательОбъект.Ссылка));
				
				ПользовательОбъект.Записать();
				
			КонецЕсли;			
			
			// Группы доступа
			//
			
			Для каждого ЭлементНастройки Из НастройкиДоступа.Настройки Цикл			
				Если ЭлементНастройки.Имя = "НоваяГруппаДоступа" Тогда					
					
					Если ЭлементНастройки.Действие = "Заменить" Тогда						
						УдалитьПользователяИзВсехГруппДоступа(СтрокаТЧ.Пользователь);						
						ДобавитьПользователяВГруппуДоступа(СтрокаТЧ.Пользователь, ЭлементНастройки.Значение);						
					КонецЕсли;
					
					Если ЭлементНастройки.Действие = "Добавить" Тогда
						ДобавитьПользователяВГруппуДоступа(СтрокаТЧ.Пользователь, ЭлементНастройки.Значение);
					КонецЕсли;					
					
					Если ЭлементНастройки.Действие = "Удалить" Тогда
						УдалитьПользователяГруппыДоступа(СтрокаТЧ.Пользователь, ЭлементНастройки.Значение);
					КонецЕсли;					
					
				КонецЕсли;								
			КонецЦикла;			 
			
			// Группы пользователей
			//
			
			Для каждого ЭлементНастройки Из НастройкиДоступа.Настройки Цикл			
				Если ЭлементНастройки.Имя = "НоваяГруппаПользователей" Тогда		
					
					Если ЭлементНастройки.Действие = "Заменить" Тогда						
						УдалитьПользователяИзВсехГруппПользователей(СтрокаТЧ.Пользователь);						
						ДобавитьПользователяВГруппуПользователей(СтрокаТЧ.Пользователь, ЭлементНастройки.Значение);						
					КонецЕсли;
					
					Если ЭлементНастройки.Действие = "Добавить" Тогда
						ДобавитьПользователяВГруппуПользователей(СтрокаТЧ.Пользователь, ЭлементНастройки.Значение);
					КонецЕсли;					
					
					Если ЭлементНастройки.Действие = "Удалить" Тогда
						УдалитьПользователяГруппыПользователей(СтрокаТЧ.Пользователь, ЭлементНастройки.Значение);
					КонецЕсли;						
					
				КонецЕсли;								
			КонецЦикла;		
			
			// Время доступа
			//
			
			Для каждого ЭлементНастройки Из НастройкиДоступа.Настройки Цикл			
				Если ЭлементНастройки.Имя = "ДатаОкончанияДоступа" Тогда	
					
					РегистрыСведений.ВремяДоступаПользователейСУО.УстановитьВремяДоступа(СтрокаТЧ.Пользователь,,ЭлементНастройки.Значение, Истина);
					
			 	КонецЕсли;								
			КонецЦикла;	
			
			// Веб-кабинет
			//
			
			Для каждого ЭлементНастройки Из НастройкиДоступа.Настройки Цикл			
				Если ЭлементНастройки.Имя = "ВходВВебКабинетРазрешен" Тогда	
					
					Если ЭлементНастройки.Значение = Истина Тогда
						РегистрыСведений.ПользователиВебКабинетаСУ.ЗаписатьПользователя(СтрокаТЧ.Пользователь);
					Иначе
						РегистрыСведений.ПользователиВебКабинетаСУ.УдалитьПользователя(,СтрокаТЧ.Пользователь);
					КонецЕсли;
					
			 	КонецЕсли;								
			КонецЦикла;	
			
			// Рассылки		
			//
			
			Если НастройкиДоступа.Рассылка <> Неопределено Тогда
				
				НоваяРассылка = Документы.РассылкаСообщенийСУО.СоздатьДокумент();
					
				НоваяРассылка.Дата = ТекущаяДатаСеанса();				
				НоваяРассылка.Автор = Пользователи.ТекущийПользователь();
				НоваяРассылка.Шаблон = НастройкиДоступа.Рассылка.Шаблон;
				НоваяРассылка.Описание = НСтр("ru = 'Автоматическое уведомление об изменении настроек доступа'");
				НоваяРассылка.Основание = СтрокаТЧ.Пользователь;
				НоваяРассылка.ТолькоЭлектроннаяПочта = НастройкиДоступа.Рассылка.ТолькоЭлектроннаяПочта;
				НоваяРассылка.АвтоматическаяРассылка = Истина;
				НоваяРассылка.ТипАвтоматическойРассылки = Неопределено;
				НоваяРассылка.ЭлектроннаяПочта = НастройкиДоступа.Рассылка.ВидЭлектронногоАдреса;
				
				НовыйАдресат = НоваяРассылка.Адресаты.Добавить();
				НовыйАдресат.Пользователь = СтрокаТЧ.Пользователь; 
				
				НоваяРассылка.ЗаполнитьПеременные();
				
				Если ОписаниеПользователяИБ <> Неопределено
					И ОписаниеПользователяИБ.Свойство("Пароль")
					И ЗначениеЗаполнено(ОписаниеПользователяИБ.Пароль) Тогда
					
					ПеременнаяРассылкиСтрокаТЧ = НоваяРассылка.ЗначенияПеременных.Найти(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НовыйПароль, "Переменная");
					Если ПеременнаяРассылкиСтрокаТЧ = Неопределено Тогда
						ПеременнаяРассылкиСтрокаТЧ = НоваяРассылка.ЗначенияПеременных.Добавить();
						ПеременнаяРассылкиСтрокаТЧ.Переменная = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.НовыйПароль;
					КонецЕсли;					
					ПеременнаяРассылкиСтрокаТЧ.Значение = ОписаниеПользователяИБ.Пароль;
					
				КонецЕсли;
				
				НоваяРассылка.Записать(); // Не проводим				
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		
		ТекстСообщения = НСтр("ru = 'Настройки не были установлены'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОбновитьДанныеВсехПользователей();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеВсехПользователей()
	
	Для каждого СтрокаТЧ Из Объект.Пользователи Цикл
	
		ДанныеДоступаПользователя = ДанныеДоступаПользователя(СтрокаТЧ.Пользователь);
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеДоступаПользователя);		
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ВременнаяТаблицаПользователей = Новый ТаблицаЗначений();
	ВременнаяТаблицаПользователей.Колонки.Добавить("Пользователь");
	ВременнаяТаблицаПользователей.Колонки.Добавить("Наименование");
	
	Для каждого Строка Из Объект.Пользователи Цикл
	
		НоваяСтрока = ВременнаяТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Строка.Пользователь;
		НоваяСтрока.Наименование = Строка.ПолноеИмя;
	
	КонецЦикла;
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ВременнаяТаблицаПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;		
	
КонецФункции

// Группы доступа

&НаСервереБезКонтекста
Процедура УдалитьПользователяИзВсехГруппДоступа(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УдалитьПользователяГруппыДоступа(Пользователь, ВыборкаДетальныеЗаписи.ГруппаДоступа)
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьПользователяГруппыДоступа(Пользователь, ГруппаДоступа)
	
	ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
	НайденнаяСтрокаТЧ = ГруппаДоступаОбъект.Пользователи.Найти(Пользователь, "Пользователь");						
	Если НайденнаяСтрокаТЧ <> Неопределено Тогда
		ГруппаДоступаОбъект.Пользователи.Удалить(НайденнаяСтрокаТЧ);
		ГруппаДоступаОбъект.Записать();
	КонецЕсли;												
	
	НайденнаяСтрокаТЧ = Неопределено;
	ГруппаДоступаОбъект = Неопределено;		
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПользователяВГруппуДоступа(Пользователь, ГруппаДоступа)
	
	ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();						
	Если ГруппаДоступаОбъект.Пользователи.Найти(Пользователь, "Пользователь") = Неопределено Тогда
		ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Пользователь;
		ГруппаДоступаОбъект.Записать();	
	КонецЕсли;							
	
	ГруппаДоступаОбъект = Неопределено;	
	
КонецПроцедуры

// Группы пользователей

&НаСервереБезКонтекста
Процедура УдалитьПользователяИзВсехГруппПользователей(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставГруппыПользователей.Ссылка КАК ГруппаПользователей
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК СоставГруппыПользователей
		|ГДЕ
		|	СоставГруппыПользователей.Пользователь = &Пользователь
		|	И СоставГруппыПользователей.Ссылка <> &ГруппаВсеПользователи";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ГруппаВсеПользователи", Справочники.ГруппыПользователей.ВсеПользователи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УдалитьПользователяГруппыПользователей(Пользователь, ВыборкаДетальныеЗаписи.ГруппаПользователей)
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьПользователяГруппыПользователей(Пользователь, ГруппаПользователей)
	
	Если ГруппаПользователей = Справочники.ГруппыПользователей.ВсеПользователи Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаПользователейОбъект = ГруппаПользователей.ПолучитьОбъект();
	НайденнаяСтрокаТЧ = ГруппаПользователейОбъект.Состав.Найти(Пользователь, "Пользователь");						
	Если НайденнаяСтрокаТЧ <> Неопределено Тогда
		ГруппаПользователейОбъект.Состав.Удалить(НайденнаяСтрокаТЧ);
		ГруппаПользователейОбъект.Записать();
	КонецЕсли;												
	
	НайденнаяСтрокаТЧ = Неопределено;
	ГруппаПользователейОбъект = Неопределено;		
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПользователяВГруппуПользователей(Пользователь, ГруппаПользователей)
	
	Если ГруппаПользователей = Справочники.ГруппыПользователей.ВсеПользователи Тогда
		Возврат;
	КонецЕсли;	
	
	ГруппаПользователейОбъект = ГруппаПользователей.ПолучитьОбъект();						
	Если ГруппаПользователейОбъект.Состав.Найти(Пользователь, "Пользователь") = Неопределено Тогда
		ГруппаПользователейОбъект.Состав.Добавить().Пользователь = Пользователь;
		ГруппаПользователейОбъект.Записать();	
	КонецЕсли;							
	
	ГруппаПользователейОбъект = Неопределено;	
	
КонецПроцедуры



#КонецОбласти
